<h1>Activity: Dataframes with pandas</h1>

## Introduction

Your work as a data professional for the U.S. Environmental Protection Agency (EPA) requires you to analyze air quality index data collected from the United States and Mexico.

The air quality index (AQI) is a number that runs from 0 to 500. The higher the AQI value, the greater the level of air pollution and the greater the health concern. For example, an AQI value of 50 or below represents good air quality, while an AQI value over 300 represents hazardous air quality. Refer to this guide from [AirNow.gov](https://www.airnow.gov/aqi/aqi-basics/) for more information.

In this lab, you will practice working in pandas. You will load a dataframe, examine its metadata and summary statistics, and explore it using iloc indexing and sorting. You will also practice Boolean masking, grouping, and concatenating data.

In [1]:
#Import librarlies 

import numpy as np
import pandas as pd

In [35]:
# Read in the first file

top3 = pd.read_csv('epa_ca_tx_pa.csv')

top3.head()

   state_code  state_name  county_code county_name   aqi
0           6  California            1     Alameda  11.0
1           6  California            7       Butte   6.0
2           6  California           19      Fresno  11.0
3           6  California           29        Kern   7.0
4           6  California           29        Kern   3.0

In [36]:
# Check the df 
top3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 546 entries, 0 to 545
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state_code   546 non-null    int64
 1   state_name   546 non-null    object
 2   county_code  546 non-null    int64
 3   county_name  546 non-null    object
 4   aqi          546 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 21.5+ KB

In [37]:
# Df statistics
top3.describe()

       state_code  county_code         aqi
count  546.000000   546.000000  546.000000
mean    20.593407    83.179487    8.906593
std     19.001484    92.240873    9.078479
min      6.000000     1.000000    0.000000
25%      6.000000    29.000000    3.000000
50%      6.000000    66.000000    6.000000
75%     42.000000    98.500000   11.000000
max     48.000000   479.000000   93.000000

In [38]:
# Check to value of the states count in df
top3['state_name'].value_counts()

California      342
Texas           104
Pennsylvania    100
Name: state_name, dtype: int64

In [40]:
# Sort by AQI attribute

top3_sorted = top3.sort_values(by='aqi', ascending=False)

top3_sorted.head()

     state_code  state_name  county_code    county_name   aqi
76            6  California           37    Los Angeles  93.0
146           6  California           37    Los Angeles  59.0
41            6  California           83  Santa Barbara  47.0
122           6  California           59         Orange  47.0
184           6  California           59         Orange  47.0

In [41]:
# Use iloc to select rows

top3_sorted.iloc[10:12]

     state_code  state_name  county_code  county_name   aqi
186           6  California           73    San Diego  39.0
74            6  California           37  Los Angeles  38.0

In [42]:
# Basic Boolean masking

mask = top3_sorted['state_name'] == 'California'

ca_df =top3_sorted[mask]

ca_df.head()

     state_code  state_name  county_code    county_name   aqi
76            6  California           37    Los Angeles  93.0
146           6  California           37    Los Angeles  59.0
41            6  California           83  Santa Barbara  47.0
122           6  California           59         Orange  47.0
184           6  California           59         Orange  47.0

In [43]:
# Validate CA data
ca_df.shape

(342, 5)

In [46]:
# Rows per CA county

ca_df['county_name'].value_counts()

Los Angeles        55
Santa Barbara      26
San Bernardino     21
Orange             19
San Diego          19
Sacramento         17
Alameda            17
Fresno             16
Riverside          14
Contra Costa       13
Imperial           13
San Francisco       8
Monterey            8
Humboldt            8
Santa Clara         7
El Dorado           7
Placer              6
Butte               6
Kern                6
Mendocino           6
Solano              5
San Joaquin         5
Tulare              5
Ventura             5
Sutter              4
San Mateo           4
Marin               3
Sonoma              3
Stanislaus          3
San Luis Obispo     2
Napa                2
Santa Cruz          2
Calaveras           2
Shasta              1
Tuolumne            1
Inyo                1
Yolo                1
Mono                1
Name: county_name, dtype: int64

### 4d: Calculate mean AQI for Los Angeles county

You notice that Los Angeles county has more than twice the number of rows of the next-most-represented county in California, and you want to learn more about it.

*  Calculate the mean AQI for LA county.

In [66]:
Calculate mean AQI for Los Angeles county

#ca_df.groupby(['county_name']).mean().sort_values(by ='aqi', ascending =False)
mask_la = ca_df['county_name'] == 'Los Angeles'
ca_df[mask_la]['aqi'].mean()

13.4

In [71]:
# Groupby

top3.groupby(['state_name'])[['aqi']].mean()

                   aqi
state_name
California    9.412281
Pennsylvania  6.690000
Texas         9.375000

In [72]:
# Read in the second file

other_states = pd.read_csv('epa_others.csv')

other_states.head()

   state_code state_name  county_code county_name   aqi
0           4    Arizona           13    Maricopa  18.0
1           4    Arizona           13    Maricopa   9.0
2           4    Arizona           19        Pima  20.0
3           8   Colorado           41     El Paso   9.0
4          12    Florida           31       Duval  15.0

In [77]:
# Concatenate the data

combined_df = pd.concat([top3, other_states], axis= 0)


combined_df.size == top3.size + other_states.size

True

In [92]:
# Complex Boolean masking

mask = (combined_df['state_name'] == 'Washington') & (combined_df['aqi'] >= 51)

combined_df[mask]

     state_code  state_name  county_code            county_name   aqi
76            6  Washington           37            Los Angeles  93.0
146           6  Washington           37            Los Angeles  59.0
40           53  Washington           33                   King  55.0
44            4  Washington           13               Maricopa  56.0
62           32  Washington           31                 Washoe  52.0
75           47  Washington          157                 Shelby  74.0
82           53  Washington           61              Snohomish  76.0
89            4  Washington           13               Maricopa  66.0
91            4  Washington           13               Maricopa  60.0
121          53  Washington           77                 Yakima  58.0
122          53  Washington           77                 Yakima  57.0
164          41  Washington           29                Jackson  51.0
205          35  Washington            1             Bernalillo  54.0
428           4  Washington           13               Maricopa  66.0
553           9  Washington            3               Hartford  61.0
696          80  Washington            2  BAJA CALIFORNIA NORTE  60.0
928          80  Washington            2  BAJA CALIFORNIA NORTE  79.0